## 15. How to join DataFrames in pandas?
We often have to form a DataFrame from a number of smaller DataFrames. Pandas top-level flexible funtions 'concat( )' and 'merge( )' are ideal for such operations. In this blog we will learn about using and differences between 'concat( )' and 'merge( )'.

In [1]:
import pandas as pd

### 15.1. Using 'concat' function for joining DataFrames

#### 15.1.1. Building a DataFrame from multiple files (row-wise)

We have become familiar with the drill now. Read a dataset from a link or local disk and assign it to a DataFrame to work with it with pandas. We will read three datasets into three DataFrames, each containing stock opening and closing price for one day.

In [2]:
df1 = pd.read_csv("https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks1.csv")
df1

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT

In [3]:
df2 = pd.read_csv("https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks2.csv")
df2

         Date   Close    Volume Symbol
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO

In [4]:
df3 = pd.read_csv("https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks3.csv")
df3

         Date   Close    Volume Symbol
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

We can use a top-level function ‘concat( )’ to perform this task. We will pass a list of DataFrames we want to stack horizontally, in order of the names provided in the list. The parameter ‘axis=0’ is optional, as that is the default value. Understand that, it doesn’t have to be a list of DataFrames, it can be a tuple or other iterable.

In [5]:
pd.concat([df1, df2, df3], axis=0)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

Notice that, while stacking horizontally, the index of DataFrame is carried along with it. We can ask pandas to leave the index by saying ‘ignore_index=True’. Pandas will create a new integer index in that case.

In [6]:
pd.concat([df1, df2, df3], axis="index", ignore_index=True)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

What we did above works, but is not memory efficient. We created three DataFrame to create our one needed DataFrame. We can use python comprehension to make the process memory efficient. First, we will create a list of datasets. Next, we will call ‘concat( )’ and pass it a python comprehension, here tuple comprehension. Here is how list/tuple comprehension generally works. A comprehension is enclosed within a list or tuple and can be divided into two parts. The second part will be a regular 'for' loop, and the first part will be the object we want as a member of the list or tuple, depending on what encloses the comprehension. Thus the python comprehension below will return a tuple of DataFrames and pass it to ‘concat( )’ function. The ‘igrone_index=True’ parameter will drop the old index and we will have our DataFrame. Note that the other DataFrames (df1, df2, df3) don’t exist and thus no memory needs to be allocated for them.

In [7]:
stock_files = ["https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks1.csv",
               "https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks2.csv",
               "https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks3.csv"]
stock_files

['https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks1.csv',
 'https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks2.csv',
 'https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/stocks3.csv']

In [8]:
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

#### 15.1.2. Building a DataFrame from multiple files (column-wise)

We will now read two DataFrames, each containing a portion of the ‘drinks’ DataFrame we have used in previous blogs. Again, we will read the datasets and store them into DataFrames to work with pandas.

In [11]:
df1 = pd.read_csv("https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/drinks1.csv")
df1.head()

       country  beer_servings  spirit_servings
0  Afghanistan              0                0
1      Albania             89              132
2      Algeria             25                0
3      Andorra            245              138
4       Angola            217               57

In [12]:
df2 = pd.read_csv("https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/drinks2.csv")
df2.head()

   wine_servings  total_litres_of_pure_alcohol continent
0              0                           0.0      Asia
1             54                           4.9    Europe
2             14                           0.7    Africa
3            312                          12.4    Europe
4             45                           5.9    Africa

Stacking DataFrame column-wise is similar to stacking DataFrames row-wise, except the ‘axis=1’ parameter. Also, note that pandas will align the indexes of DataFrames when stacking them vertically. If some indexes do not match, pandas will create new rows with those indexes.

In [13]:
pd.concat([df1, df2], axis=1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

Again, what we did above works, but is not memory efficient. We created two DataFrame to create our one needed DataFrame. We will use python comprehension as we used above. The ‘igrone_index=True’ parameter is not required as pandas won’t bring the indexes of DataFrames when stacking vertically. Note that the other DataFrames (df1, df2) don’t exist and thus no memory needs to be allocated for them.

In [14]:
drinks_files = ["https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/drinks1.csv",
                "https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/drinks2.csv"]
drinks_files

['https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/drinks1.csv',
 'https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/drinks2.csv']

In [15]:
pd.concat((pd.read_csv(file) for file in drinks_files), axis="columns").head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

Note that when using ‘concat( )’ function we were careful to use the word ‘stacking’ and not ‘merging’. The DataFrames were simply stacked horizontally or vertically but not merged i.e. columns from the two DataFrames were not merged into one. But we may need the ability to merge our DataFrames. The answer is another top-level function ‘merge( )’.

### 15.2. Using 'merge' function for joining DataFrames

#### Movies DataFrame

We will be using two datasets to learn about the ‘merge( )’ function. The first dataset contains several columns among them we will read ‘movie_id’ and the corresponding title of the movie in a DataFrame called ‘movies’. We can check the shape of the DataFrame and the number of unique values in ‘movie_id’. Notice the number of rows in the DataFrame is the same as the number of unique values ‘movie_id’. We can be sure that each row of the DataFrame as a unique ‘movie_id’.

In [16]:
movie_cols = ["movie_id", "title"]
movies = pd.read_table("https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/u.item",
                      sep="|", header=None, names=movie_cols, usecols=[0, 1])
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [17]:
movies.shape

(1682, 2)

In [18]:
movies.movie_id.nunique()

1682

#### Ratings DataFrame

The second dataset contains the ‘user_id’ of users who rated movies with ‘movie_id’ and provided ‘rating’ at ‘timestamp’. We will read the dataset in a DataFrame called ‘ratings’. We can check the shape of the DataFrame ‘ratings’ and the number of unique values in ‘movie_id’. Notice the number of unique values ‘movie_id’ in ‘ratings’ DataFrame is the same as in ‘movies’ DataFrame. We will need metadata information to be sure they are the same, but since I am aware of the dataset, you can be sure the values in ‘movie_id’ is the same for both DataFrame. Also, understand that there are multiple ratings provided by multiple users to the same movie resulting in a lot of rows. We need to merge the DataFrames to have movie names and ratings provided by users in one DataFrame.

In [19]:
rating_cols = ["user_id", "movie_id", "rating", "timestamp"]
ratings = pd.read_table("https://raw.githubusercontent.com/ujwal-sah/pandas-videos/master/data/u.data",
                       sep="\t", header=None, names=rating_cols)
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [20]:
ratings.shape

(100000, 4)

In [21]:
ratings.movie_id.nunique()

1682

We can see the ratings provided by users to movie 1 with ‘movie_id=1’ using loc as below.

In [22]:
ratings.loc[ratings.movie_id == 1, :].head()

      user_id  movie_id  rating  timestamp
24        308         1       4  887736532
454       287         1       5  875334088
957       148         1       4  877019411
971       280         1       4  891700426
1324       66         1       3  883601324

#### 15.2.1. Merging DataFrames with matching column name

When we have two DataFrames with the same column names we can merge the DataFarmes over those columns. Notice that ‘movies’ and ‘ratings’ DataFrames have ‘movie_id’ as a common column. If we merge these two DataFrames the final DataFrames will have only one column called ‘movie_id’. To merge the DataFrames we will use the top-level ‘merge( )’ function and pass the DataFrame names. The first name we provide will become the left part of the resulting DataFrame and the second name will be the right part. We won’t have to specify the column we want to merge on as pandas automatically merge on column(s) with the same names. We will assign the final DataFrame to ‘movie_ratings’. Understand that while merging pandas will take a row from the smaller DataFrame and repeat the vales for every single matching vale in larger DataFrame.

In [23]:
movies.columns

Index(['movie_id', 'title'], dtype='object')

In [24]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [25]:
movie_ratings = pd.merge(movies, ratings)
movie_ratings.columns

Index(['movie_id', 'title', 'user_id', 'rating', 'timestamp'], dtype='object')

In [26]:
movie_ratings.head()

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324

We will check the shape of each DataFrame. Notice that the number of rows in ‘ratings’ and ‘movie_ratings’ is the same as the process of merging only added names of movies in ‘ratings’ DataFrame and formed resulting DataFrame ‘movie_ratings’.

In [27]:
movie_ratings.shape

(100000, 5)

In [28]:
print(movies.shape)
print(ratings.shape)
print(movie_ratings.shape)

(1682, 2)
(100000, 4)
(100000, 5)

#### 15.2.2. Merging DataFrames when there are no matching column names

When two DataFrames don’t have common column names, we can still merge them. We will change the names of columns of the ‘movies’ DataFrame to understand the method. We will use the ‘merge( )’ function with the names of DataFrames as we did above. In addition we will pass ‘left_on = name of column(s) we want to merge on in left DataFrame’ and ‘right_on = name of column(s) we want to merge on in right DataFrame’. Note that in this case, the number of columns in resulting DataFrame will be the sum of the number of columns in individual DataFrame.

In [29]:
movies.columns = ["m_id", "title"]
movies.columns

Index(['m_id', 'title'], dtype='object')

In [30]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [31]:
pd.merge(movies, ratings, left_on="m_id", right_on="movie_id").head()

   m_id             title  user_id  movie_id  rating  timestamp
0     1  Toy Story (1995)      308         1       4  887736532
1     1  Toy Story (1995)      287         1       5  875334088
2     1  Toy Story (1995)      148         1       4  877019411
3     1  Toy Story (1995)      280         1       4  891700426
4     1  Toy Story (1995)       66         1       3  883601324

#### 15.2.3. Merging DataFrames on index of one DataFrame


The column(s) we want to merge on can be the index of one DataFrame and column(s) of the other DataFrame. We will use the ‘merge( )’ function with the names of DataFrames as we did above. In addition, we will pass ‘left_index=True’ and ‘right_on = name of column(s) we want to merge on in right DataFrame’. Note that the index ‘m_id’ of left DataFrame disappears in the process and the index of right DataFrame becomes the index of resulting DataFrame. It may be difficult to understand the logic but we will it a try. The index of left DataFrame ‘m_id’ is present in the resulting DataFrame in form of column in right DataFrame called ‘movie_id’, they both provide the same information. So although the index of left DataFrame is absent the information provided by the index was retained. Imagine the index of right DataFrame was meaningful, assigning the index of right DataFrame as the index of resulting DataFrame helps us retain that information as well. So, in the overall process, no information is lost.

In [32]:
movies = movies.set_index("m_id")
movies.head()

                  title
m_id
1      Toy Story (1995)
2      GoldenEye (1995)
3     Four Rooms (1995)
4     Get Shorty (1995)
5        Copycat (1995)

In [33]:
pd.merge(movies, ratings, left_index=True, right_on="movie_id").head()

                 title  user_id  movie_id  rating  timestamp
24    Toy Story (1995)      308         1       4  887736532
454   Toy Story (1995)      287         1       5  875334088
957   Toy Story (1995)      148         1       4  877019411
971   Toy Story (1995)      280         1       4  891700426
1324  Toy Story (1995)       66         1       3  883601324

#### 15.2.4. Merging DataFrames on indexes of two DataFrames

We can merge two DataFrames on the index of the two DataFrames. We will use the ‘merge( )’ function with the names of DataFrames as we did above. In addition, we will pass ‘left_index=True’ and ‘right_index=True’. The index of the resulting DataFrame will be the index of left DataFrame. Note that since both indexes provide sam information, no information is lost in the process.

In [34]:
ratings = ratings.set_index("movie_id")
ratings.head()

          user_id  rating  timestamp
movie_id
242           196       3  881250949
302           186       3  891717742
377            22       1  878887116
51            244       2  880606923
346           166       1  886397596

In [35]:
pd.merge(movies, ratings, left_index=True, right_index=True).head()

              title  user_id  rating  timestamp
1  Toy Story (1995)      308       4  887736532
1  Toy Story (1995)      287       5  875334088
1  Toy Story (1995)      148       4  877019411
1  Toy Story (1995)      280       4  891700426
1  Toy Story (1995)       66       3  883601324

There are four ways to merge (inner, outer, left, right), which we can specify using the ‘how’ parameter in the ‘merge( )’ function. While merging the two DataFrames above, for every ‘movie_id’ in ‘movies’ DataFrame, there was a ‘movie_id’ in ‘ratings’ DataFrame, so using any way of merging we would have got the same result. However, that may not always be the case. We will learn more about ways of merging in the next section.

#### 15.2.5. Understanding differences between 'join' when using 'merge' method

We will begin by creating two DataFrame ‘A’ and ‘B’. DataFrame ‘A’ will have two columns called ‘color’ and ‘num’. Similarly, DataFrame ‘B’ will have two columns called ‘color’ and ‘size’. Using ‘color’ as the common column between the two DataFrames we will learn about ways of merging. We won’t have to specify the column we want to merge on as pandas automatically merge on column(s) with the same names.

In [36]:
A = pd.DataFrame({"color":["green", "yellow", "red"], "num":[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [37]:
B = pd.DataFrame({"color":["green", "yellow", "pink"], "size":["S", "M", "L"]})
B

    color size
0   green    S
1  yellow    M
2    pink    L

Inner join can be achieved by passing “how=’inner’”. It is also the default method used when we don’t specify the method. This method of merging returns a DataFrame with rows for which the column we are merging on, here ‘color’, is present in both DataFrames. Notice that ‘red’ is present only in DataFrame ‘A’ and ‘pink’ is present only in DataFrame ‘B’ those rows won’t be present in resulting DataFrame.

In [38]:
#inner join
pd.merge(A, B, how="inner")

    color  num size
0   green    1    S
1  yellow    2    M

Outer join can be achieved by passing “how=’outer’”. This method of merging returns a DataFrame with rows for every value of the column we are merging on, here ‘color’, present in both DataFrames. Notice that ‘red’ is present only in DataFrame ‘A’ and ‘pink’ is present only in DataFrame ‘B’, but both the rows were included in the resulting DataFrame. The values which were not available while merging were termed missing.

In [39]:
#outer join
pd.merge(A, B, how="outer")

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

Left join can be achieved by passing “how=’left’”. This method of merging returns a DataFrame with rows for every value of the column in the left DataFrame we are merging on, here ‘color’. Notice that ‘red’ is present only in left DataFrame ‘A’ was part of resulting DataFrame but ‘pink’ is present only in right DataFrame ‘B’ was absent from resulting DataFrame. The values which were not available while merging were termed missing.

In [40]:
#left join
pd.merge(A, B, how="left")

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

Right join can be achieved by passing “how=’right’”. This method of merging returns a DataFrame with rows for every value of the column in the right DataFrame we are merging on, here ‘color’. Notice that ‘red’ is present only in left DataFrame ‘A’ was absent from resulting DataFrame but ‘pink’ present only in right DataFrame ‘B’ is present from resulting DataFrame. The values which were not available while merging were termed missing.

In [41]:
#right join
pd.merge(A, B, how="right")

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L